import { useState , useContext } from "react";
import { context } from "../../../App";
const Tex = () => {
    const products = useContext(context);
  const [expanded, setExpanded] = useState(false);

  return (
    <>
      <div className="tex w-[98%] max-w-[1680px]   h-fit flex  mx-auto mt-10 border-t border-b ">
        {/* متن */}
        <div className="texet lg:w-[63%] h-full relative overflow-hidden px-4 py-6">
          <span
            className={` text-[10px] lg:text-[12px]   leading-6 text-[#81858B] transition-all duration-300 ease-in-out ${
              expanded ? "line-clamp-none" : "line-clamp-4"
            }`}
          >
            <h1 className=" text-[12px] lg:text-[21px]  text-[#62666D] pb-2  ">
              دیجی کالا؛ بزرگترین فروشگاه اینترنتی ایران
            </h1>{" "}
            ایران. دیجی کالا سال‌ها است که به انتخاب اول بسیاری از خریداران
            اینترنتی تبدیل شده است. دیجی کالا به عنوان بزرگ‌ترین و معتبرترین
            فروشگاه آنلاین ایران، شناخته‌شده‌ترین فروشگاه نیز محسوب می‌شود. این
            فروشگاه آنلاین نه‌تنها گسترده‌ترین تنوع کالا را در دسته‌بندی‌های
            مختلف ارائه می‌دهد، بلکه با خدمات بی‌نظیر،  <span className=" text-[#19BFD3]"  >ارسال</span>ارسال سریع، ضمانت اصل
            بودن کالا و پشتیبانی حرفه‌ای، استاندارد جدیدی در خرید اینترنتی ایران
            تعریف کرده است. این فروشگاه با سال‌ها تجربه و اعتماد مشتریان،
            کامل‌ترین و بهترین گزینه برای خرید آنلاین در ایران محسوب می‌شود.{" "}
            <h3 className=" text-[16px] text-[#81858B] ">
              ویژگی های مهم دیجی کالا
            </h3>{" "}
            یکی از ویژگی‌های مهم در خرید از دیجی کالا، تنوع بی‌نظیر محصولات است.
            این فروشگاه اینترنتی طیف وسیعی از کالاها را در دسته‌های مختلف از
            جمله لوازم دیجیتال، لوازم خانگی، مد و پوشاک، لوازم آرایشی و بهداشتی،
            محصولات سلامت و زیبایی، و بسیاری از محصولات دیگر ارائه می‌دهد. به
            عنوان مثال، اگر به دنبال خرید یک گوشی موبایل جدید باشید، دیجی کالا
            مجموعه‌ای از بهترین گوشی‌ها از برندهای معتبر اپل و سامسونگ مانند
            ایفون 16، گوشی  <span className=" text-[#19BFD3]"  > شیائومی</span>S25، گوشی‌های مختلف از برند شیائومی مانند نوت
            ۱۴ و بسیاری از برندهای دیگر را در اختیار شما قرار می‌دهد. همچنین
            برای علاقه‌مندان به لوازم دیجیتال، این فروشگاه اینترنتی انواع لپ
            تاپ، تلویزیون، اسپیکر، و هندزفری بلوتوثی با کیفیت بالا را برای خرید
            آنلاین ارائه می‌دهد. دیجی کالا، مقصدی بی‌پایان برای خرید آسان، سریع
            و مطمئن است. راهی که هر آنچه نیاز دارید از قیمت لپ تاپ تا یک ایرپاد
            مطمئن را در اختیار شما قرار می‌دهد.{" "}
            <h3 className=" text-[16px] text-[#81858B] ">
              ارسال سریع و مطمئن کالا
            </h3>{" "}
            یکی از مهم‌ترین دغدغه‌های کاربران خرید آنلاین، زمان تحویل کالا است.
            دیجی کالا برای حل این مشکل، گزینه‌های مختلف ارسال را در نظر گرفته
            است تا کاربران بتوانند بر اساس نیاز خود، روش ارسال مناسب را انتخاب
            کنند. به عنوان مثال، ارسال کالا به صورت تحویل امروز با ارسال سریع
            دیجی‌کالا، از جمله روش‌های خرید سریع از این فروشگاه اینترنتی است.
            این  باعث می‌شود که خریداران بتوانند<span className=" text-[#19BFD3]"  >امکانات</span> سفارش خود را در
            کوتاه‌ترین زمان ممکن دریافت کنند. علاوه بر این، در صورتی که کالای
            خریداری شده از لحاظ کیفیت یا هر دلیل دیگری رضایت مشتری را جلب نکرده
            باشد، دیجی کالا ضمانت بازگشت کالا را ارائه می‌دهد. این ویژگی موجب
            اعتماد بیشتر مشتریان به خرید آنلاین از فروشگاه اینترنتی دیجی کالا
            شده است. <h3 className=" text-[16px] text-[#81858B] " >تخفیف های ویژه و جشنواره ها</h3> دیجی کالا به طور منظم
            جشنواره‌ها و تخفیف‌های ویژه‌ای را برگزار می‌کند که برای مشتریان فرصت
            خرید کالاهای باکیفیت با قیمت‌های مناسب به همراه خواهد داشت. این
            تخفیف‌ها در ایام خاص مانند بلک فرایدی یا همان حراج جمعه سیاه و
            جشنواره‌های تابستانی توجه بسیاری از خریداران را جلب می‌کند. در این
            جشنواره‌ها، دیجی کالا تخفیف‌های عالی روی محصولات مختلف از جمله
            گوشی‌های موبایل، لپ تاپ‌ها، تلویزیون‌ها، و حتی<span className=" text-[#19BFD3]"  > می‌توانید گوشی</span> محصولات زیبایی ارائه
            می‌دهد. ایفون 16 یا گوشی S25 را با تخفیف‌های ویژه
            خریداری کنید و از قیمت مناسب بهره‌مند شوید. دیجی کالا فراتر از یک
            فروشگاه اینترنتی، یک تجربه خرید مطمئن در بین کاربران مختلف بوده است
            که با ارائه بزرگ‌ترین<h3 className=" text-[16px] text-[#81858B] " >انواع محصولات فروشگاه دیجی کالا</h3> بی‌نقص، به
            مقصد اول خریداران آنلاین در ایران تبدیل شده است. انواع محصولات
            فروشگاه دیجی کالا دیجی کالا دارای محصولات متنوعی در گروه‌های مختلف
            است که خرید آنها بسیار راحت و سریع است. به عنوان مثال، اگر به دنبال
            قاب گوشی یا هندزفری بلوتوثی باشید، می‌توانید مدل‌های مختلف و برندهای
            گوناگونی را در این فروشگاه پیدا کنید. موبایل و کالای دیجیتال
            دیجی‌کالا انواع گوشی‌های هوشمند از برندهای معتبر جهانی مانند
            سامسونگ، اپل، شیائومی و هواوی را با مشخصات و قیمت‌های متنوع عرضه
            می‌کند. علاوه <h3 className=" text-[16px] text-[#81858B] " >موبایل و کالای دیجیتال</h3> مجموعه‌ای از لوازم جانبی مانند
            هدفون، هندزفری، ساعت‌های هوشمند، تبلت‌ها و لپ تاپ را نیز در اختیار
            مشتریان قرار می‌دهد. با امکان مقایسه محصولات، مطالعه نظرات کاربران و
            دسترسی به جدیدترین مدل‌ها، دیجی‌کالا به یکی از مقاصد اصلی خرید
            آنلاین در حوزه موبایل و کالای دیجیتال تبدیل شده است. از دهه گذشته
            همواره دیجی کالا به عنوان اولین گزینه برای خرید گوشی های سامسونگ،
            آیفون های اپل و گوشی شیائومی محسوب می‌شده است و تا امروز هم در عرضه
            این موبایل های محبوب به بازار، دیجی‌کالا اولین فروشگاه آنلاین بوده
            است. کتاب و لوازم تحریر کتاب، لوازم تحریر و هنر در دیجی کالا یک
            مجموعه بی‌نظیر از<h3 className=" text-[16px] text-[#81858B] " >کتاب و لوازم تحریر</h3>به علاقه‌مندان به
            کتابخوانی، هنر و نوشتن کمک می‌کند تا دنیای خود را گسترش دهند. از
            کتاب‌های چاپی و کتاب‌های صوتی گرفته تا مجلات خارجی و داخلی و آثار
            معروف‌ترین نویسندگان مثل سعدی، حافظ، مولانا و فروغ فرخزاد، تمامی
            نیازهای کتابخوان‌ها را پوشش می‌دهد. همچنین با مجموعه‌ای از لوازم
            تحریر، ابزار نقاشی و رنگ‌آمیزی، آلبوم‌های عکس و فرش‌های دستبافت، به
            شما این امکان را می‌دهد تا دنیای هنر و خلاقیت خود را به بهترین نحو
            پرورش دهید. همچنین خر سال تقریبا همزمان با تهران و نمایشگاه بین
            المللی کتاب، دیجی کالا<h3 className=" text-[16px] text-[#81858B] " >لوازم آرایشی و بهداشتی</h3> را برگزار می‌کند تا
            آنها که فرصت حضور در نمایشگاه را ندارند، بتوانند مجازی از کتاب ها
            بازدید و خرید کنند. لوازم آرایشی و بهداشتی در دسته محصولات آرایشی و
            بهداشتی، دیجی کالا مجموعه‌ای از بهترین و پرطرفدارترین برندهای جهانی
            را در اختیار کاربران قرار می‌دهد. محصولات متنوعی همچون مرطوب
            كننده‌ها، كرم پودر، ضدآفتاب، ريمل و رژلب از برندهایی مانند لورال،
            کلینیک و میبلین در دیجی کالا موجود هستند که برای هر سلیقه و نیاز
            قابل انتخاب هستند. علاوه بر این، شما می‌توانید محصولات مراقبت از
            پوست و مو مانند شامپو، کرم‌های ضد چروک و ماسک صورت را در این فروشگاه
            بیابید و خرید آنلاین خود را به راحتی انجام دهید. دیجی کالا،
            بزرگ‌ترین و معتبرترین فروشگاه آنلاین لوازم آرایشی ایران، جایی که
            تنوع، کیفیت و اطمینان در خرید یکجا جمع شده‌اند. خرید آنلاین طلا و
            جواهرات دیجی کالا به عنوان بزرگترین فروشگاه اینترنتی ایران، یکی از
            بهترین گزینه‌ها برای خرید طلا و جواهرات آنلاین است. شما می‌توانید
            خريد گردنبند طلا، انگشتر طلا، گوشواره زنانه طلا و دستبند طلا را با
            بهترین قیمت‌ها از دیجی کالا انجام دهید. این فروشگاه مجموعه‌ای از
            بهترین برندهای طلا و جواهرات را در اختیار مشتریان قرار داده است که
            انتخاب خرید را برای آنها بسیار آسان می‌کند. همچنین می‌توانید خريد
            سكه، و حتی ربع سكه را نیز از این فروشگاه با راحت‌ترین روش انجام
            دهید. اسباب بازی این قسمت شامل تمامی نیازهای ضروری برای مراقبت،
            بهداشت، سرگرمی و راحتی کودک از بدو تولد تا دوران کودکی است. از لوازم
            بهداشت و حمام کودک و نوزاد مانند پوشک، دستمال مرطوب، شامپو کودک،
            حوله و وان حمام نوزاد گرفته تا محصولات ویژه‌ای مثل مینی واش و شامپو
            کودک و نوزاد، همه در این مجموعه موجود هستند. همچنین برای راحتی
            بیشتر، انواع پوشاک و کفش کودک و نوزاد از لباس نوزادی تا کفش پسرانه،
            کوله پشتی پسرانه، لباس دخترانه و کفش دخترانه به صورت آنلاین در دسترس
            شما قرار دارند. کودکان به سرگرمی‌های ویژه نیاز دارند، از همین رو
            دیجی کالا مجموعه‌ای کامل از اسباب بازی‌ها از جمله پازل‌ها، لگو و
            ساختنی‌ها، عروسک‌ها، فیگورها و اسپینر‌ها را به شما ارائه می‌دهد.
            لوازم خانگی و مبلمان در دسته‌بندی لوازم خانگی، دیجی کالا محصولات
            متنوعی را ارائه می‌دهد که برای راحتی و زیبایی خانه و آشپزخانه شما
            طراحی شده‌اند. از جمله مبل راحتی، سرویس‌های خواب، آینه‌های دکوراتیو،
            و ظروف آشپزخانه که همگی <h3 className=" text-[16px] text-[#81858B] " >خرید آنلاین طلا و جواهرات</h3> تولید شده‌اند.
            شما می‌توانید قابلمه و تابه، یخچال، ماشین لباسشویی و بسیاری از لوازم
            خانگی دیگر را از دیجی کالا خریداری کنید. مبل‌های راحتی یکی از
            پرطرفدارترین محصولات خانگی در دیجی کالا هستند. این مبل‌ها در انواع
            طرح‌ها و رنگ‌ها و از برندهای معتبر ساخته شده‌اند که با هر دکوراسیونی
            هماهنگ می‌شوند. همچنین در دیجی کالا انواع سرویس خواب با کیفیت بالا و
            طراحی روز دنیا در دسترس است. علاوه بر این، اگر به دنبال آینه
            دکوراتیو یا سایر لوازم تزئینی منزل هستید، این فروشگاه بهترین
            انتخاب‌ها را به شما ارائه می‌دهد. سوپرمارکت دیجی کالا در دسته‌بندی
            خوراکی‌ها و کالاهای اساسی دیجی کالا، شما می‌توانید انواع محصولات
            ضروری و پرمصرف روزانه <span className=" text-[#19BFD3]"  >  این مجموعه</span>. از شیرینی و آجیل تا نان تازه
            و نبات خوشمزه گرفته و رب گوجه، ماکارونی، قند، رب انار، برنج و شکر و
            حتی شیر و لبنیات همه این محصولات با بالاترین کیفیت و از برندهای
            معتبر در دسترس شما قرار شامل همه آن چیزی است که
            برای تهیه یک وعده غذایی کامل و سالم به آن نیاز دارید. خرید از سوپر
            مارکت آنلاین کمک می‌کند که به راحتی و در کمترین زمان ممکن، مواد
            اولیه مورد نیاز خود را با قیمت‌های مناسب و با تضمین کیفیت دریافت
            کنید. محصولات بومی و محلی در این بخش از دیجی کالا، از برنج، روغن،
            عسل طبیعی، حلوا شکری، ارده و کنجد سنتی گرفته تا کیک و شیرینی خانگی،
            لواشک، برگه و آلوچه خانگی، محصولات اصیل و با کیفیت ارائه می‌شود.
            همچنین، انواع لبنیات سنتی، کره گیاهی و حیوانی محلی، خرمای محلی و
            خشکبار و آجیل سنتی به <span className=" text-[#19BFD3]"  >ارگانیک</span> و حبوبات ارگانیک، ادویه‌ها و
            چاشنی‌های ارگانیک نظیر زعفران و زرشک  از دیگر گزینه‌های این
            دسته هستند. برای علاقه‌مندان به دکوراسیون سنتی نیز، محصولاتی مانند
            لوستر دست ساز، مجسمه‌های سنتی، گلدان و تابلو سنتی، کاشی و آینه سنتی
            و ظروف آشپزخانه دست ساز از جنس سنتی  <span className=" text-[#19BFD3]"  > غیر برقی</span>وجود دارد که خانه شما را به
            محیطی گرم و اصیل تبدیل خواهد کرد. ابزار آلات و تجهیزات این بخش شامل
            ابزار برقی و در دیجی کالا مجموعه‌ای کامل از ابزارهای مورد
            نیاز برای پروژه‌های صنعتی، تعمیرات و ساخت می‌شود. از ابزارهای برقی
            مانند دریل، پیچ گوشتی، فرز، سنگ رومیزی، موتور برق و مکنده-دمنده
            گرفته تا ابزارهای غیر برقی مثل ابزار دستی، نردبان، اره و مجموعه
            ابزار، این دسته برای هر نیازی <h3 className=" text-[16px] text-[#81858B] " >اسباب بازی</h3>. همچنین
            کمپرسور هوا، دستگاه جوش، هویه و ابزار برش و تراشکاری برای انجام
            کارهای دقیق صنعتی موجود است. به‌علاوه انواع لوازم روانکاری، چسب
            صنعتی، پیچ و مهره، ماسک تنفسی، لوازم ایمنی و کار و شیرآلات به تکمیل
            نیازهای شما برای کارهای<span className=" text-[#19BFD3]"  >سویشرت</span> و صنعتی کمک می‌کند. دیجی کالا یک
            راهکار کامل برای پروژه‌های حرفه‌ای و خانگی است. پوشاک از لباس‌های
            مردانه شامل هودی، ، ژاکت، پیراهن، شلوار جین، پالتو، کاپشن، کفش
            و اکسسوری تا پوشاک زنانه نظیر مانتو، بلوز، تیشرت، لباس مجلسی، لباس
            خواب، کاپشن و کفش زنانه، همگی در این دسته‌بندی موجود هستند. همچنین
            برای بچگانه‌ها، از لباس‌های <h3 className=" text-[16px] text-[#81858B] " >لوازم خانگی و مبلمان</h3> تا کفش و صندل
            بچگانه، به‌راحتی می‌توانید کالای مناسب را پیدا کنید. این بخش شامل
            برندهای معتبر مانند هامتو، چرم مشهد، اسمارا، کروم، گردیه و چرم عطارد
            است که پوشاک با کیفیت بالا را ارائه می‌دهند. خرید آنلاین لباس از
            دیجی کالا فرصتی برای همه فروشنده های شناخته شده کشور فراهم کرده است
            تا فروش اینترنتی بیشتری را تجربه کنند. همچنین شما کاربران می‌توانید
            طیف وسیعی از پوشاک را به راحتی و از طریق پروفایل همیشگی خود در
            Digikala خریداری کنید. تجهیزات پزشکی و سلامت در این بخش از تجهیزات
            پزشکی مانند فشارسنج، ترازو، تب سنج و دماسنج گرفته تا دستگاه‌های
            تنفسی و تجهیزات حرفه‌ای پزشکی، موجود هستند. برای کنترل بیماری‌هایی
            مانند دیابت و <span className=" text-[#19BFD3]"  >سرماخوردگی</span>، محصولات مناسبی از جمله کیسه نمک،
            رطوبت‌گیر، و دستگاه‌های تب سنج ارائه می‌شود. علاوه بر این، ماساژور و
            پد و کیسه آب گرم به شما کمک می‌کنند تا در خانه از تسکین درد و آرامش
            بیشتری برخوردار شوید. محصولات ورزشی و سفر دیجی کالا همچنین برای
            علاقه‌مندان به ورزش و سفر، محصولات متنوعی را در دسته‌بندی‌های مختلف
            ارائه می‌دهد. اگر به دنبال خرید وسایل ورزشی برای بدنسازی، ورزش‌های
            هوازی، یا کمپینگ هستید، دیجی کالا مجموعه‌ای از لوازم ورزشی از جمله
            وزنه، ساک ورزشی، قمقمه و بسیاری از لوازم دیگر را ارائه می‌دهد.
            همچنین شما می‌توانید برای سفرهای خود، ساک‌های مسافرتی، کوله پشتی‌های
            کوهنوردی و لوازم کمپینگ را از این فروشگاه خریداری کنید. کارت هدیه
            کارت هدیه‌ها راهی عالی برای هدیه دادن به عزیزانتان هستند و در دیجی
            کالا انواع مختلفی از آنها برای مناسبت‌های گوناگون وجود دارد. شما
            می‌توانید کارت هدیه فیزیکی دیجی کالا را به صورت عمومی یا براساس
            مناسبت‌های خاص همچون تولد یا <h3 className=" text-[16px] text-[#81858B] " >سوپرمارکت دیجی کالا</h3> کارت هدیه
            براساس قیمت امکان انتخاب هدیه‌ای مناسب با بودجه شما را فراهم می‌کند.
            علاوه بر کارت‌های فیزیکی، کارت هدیه الکترونیکی دیجی کالا هم برای
            افرادی که به دنبال یک گزینه سریع و آسان هستند، وجود دارد. مکمل های
            غذایی دیجی کالا همچنین به عنوان یکی از مراجع معتبر برای خرید مکمل
            نیز شناخته می‌شود. شما می‌توانید انواع قرص‌های ویتامین، منيزيم،
            زينك، ويتامين C و بسیاری از مکمل‌های دیگر را از برندهای معروف و
            معتبر در دیجی کالا پیدا کنید. این مکمل‌ها به سلامت شما کمک می‌کنند و
            برای تقویت سیستم ایمنی بدن یا افزایش انرژی و بهبود وضعیت پوست و مو
            مفید هستند. خرید کالاهای کارکرده خرید کالاهای کارکرده از دیجی کالا
            فرصتی عالی برای دسترسی به محصولات با کیفیت و قیمت مناسب است. تمامی
            کالاهای این دسته‌بندی در وضعیت مشابه‌نو قرار دارند و از نظر فنی و
            ظاهری کاملا سالم و بدون نقص هستند. همچنین هر کالای کارکرده‌ای که
            خریداری می‌کنید، دارای 7 روز مهلت تست و ضمانت اصالت است تا شما با
            خیال راحت از خرید خود اطمینان حاصل کنید. برای گوشی‌های موبایل
            کارکرده، این فروشگاه 3 ماه گارانتی دیجی کالا سرویس نیز ارائه می‌دهد.
            از جمله کالاهای کارکرده‌ای که می‌توانید در این دسته پیدا کنید
            می‌توان به گوشی موبایل کارکرده، لپ تاپ کارکرده، کنسول خانگی کارکرده
            و ساعت هوشمند کارکرده <h3 className=" text-[16px] text-[#81858B] " >محصولات بومی و محلی</h3> قیمت‌های به‌صرفه،
            گزینه‌ای مناسب برای کسانی است که به دنبال خرید کالاهای با کیفیت و در
            عین حال اقتصادی هستند. در آخر باید گفت خرید از دیجی کالا به دلیل
            تنوع بالای ، خدمات <span className=" text-[#19BFD3]"  >محصولات</span>، تخفیف‌های ویژه، و امکان خرید
            آنلاین کالاهای متنوع از برندهای معتبر، یکی از بهترین انتخاب‌ها برای
            خریداران آنلاین در ایران است. با استفاده از خدمات دیجی کالا، خریدی
            مطمئن، سریع و راحت را تجربه خواهید کرد.
          </span>

          {/* دکمه مشاهده بیشتر / بستن */}
          <button
            className="absolute bottom-1 right-3 text-[#19BFD3] text-xs underline"
            onClick={() => setExpanded(!expanded)}
          >
            {expanded ? "بستن" : "مشاهده بیشتر"}
          </button>
        </div>

        {/* باکس اعتماد در کنار متن */}
        <div className="etemad w-[37%] h-[180px]   gap-6 p-7 hidden lg:flex ">
            {products.etemad.map((item)=>(
                <div  key={item.id} className="box w-[108px] h-[108px] border rounded-lg flex justify-center items-center ">
                    <img src={item.image} className=" w-[70px] h-[70px] " alt="" />
                </div>
            ))}
        </div>
      </div>
    </>
  );
};

export default Tex;
